In [2]:
import pandas as pd
import numpy as np

In [8]:
#create series object-1d array
ds1=pd.Series([11,12,13,14],index=list('abcd'))
ds1

a    11
b    12
c    13
d    14
dtype: int64

In [4]:
type(ds1)

pandas.core.series.Series

In [9]:
ds1[0]#index value

11

In [10]:
ds1['a']#index label

11

In [11]:
ds1[3]

14

In [12]:
ds1.index=list('pqrs')

In [13]:
ds1

p    11
q    12
r    13
s    14
dtype: int64

In [14]:
ds2=pd.Series(np.arange(1,12,2),index=list('abcdef'))

In [15]:
ds2

a     1
b     3
c     5
d     7
e     9
f    11
dtype: int32

In [16]:
ds3=pd.Series({'name':'nagma','age':22})
ds3

name    nagma
age        22
dtype: object

In [18]:
#add data
ds1['a']=900
ds1

p     11
q     12
r     13
s     14
a    900
dtype: int64

In [20]:
#first 5 data
ds1[0:5:]

p     11
q     12
r     13
s     14
a    900
dtype: int64

In [21]:
ds1['p':'a']

p     11
q     12
r     13
s     14
a    900
dtype: int64

In [22]:
ds1[0:3]

p    11
q    12
r    13
dtype: int64

In [23]:
ds1

p     11
q     12
r     13
s     14
a    900
dtype: int64

In [24]:
ds1['f']=55

In [25]:
ds1

p     11
q     12
r     13
s     14
a    900
f     55
dtype: int64

In [27]:
ds1['p']=111#modify

In [28]:
ds1

p    111
q     12
r     13
s     14
a    900
f     55
dtype: int64

In [29]:
#drop -deletes from the copy
ds1.drop('f')

p    111
q     12
r     13
s     14
a    900
dtype: int64

In [30]:
ds1#original series

p    111
q     12
r     13
s     14
a    900
f     55
dtype: int64

In [31]:
ds1.drop('f',inplace=True)# to delete from the og

In [32]:
ds1

p    111
q     12
r     13
s     14
a    900
dtype: int64

In [33]:
#mean
ds1.mean()

210.0

In [34]:
ds1.sum()

1050

In [35]:
ds1.min()

12

In [36]:
ds1.max()

900

In [37]:
ds1.count()

5

In [38]:
ds1.sum()/ds1.count()

210.0

In [39]:
ds1['g']=np.nan

In [40]:
ds1['h']=np.nan

In [41]:
ds1

p    111.0
q     12.0
r     13.0
s     14.0
a    900.0
g      NaN
h      NaN
dtype: float64

In [44]:
ds1.mean(skipna=False)

nan

In [48]:
ds1.isnull()

p    False
q    False
r    False
s    False
a    False
g     True
h     True
dtype: bool

In [49]:
ds1.isnull().sum()

2

In [50]:
ds1.fillna(1000)#return new series

p     111.0
q      12.0
r      13.0
s      14.0
a     900.0
g    1000.0
h    1000.0
dtype: float64

In [51]:
ds1.fillna(1000,inplace=True)

In [52]:
ds1

p     111.0
q      12.0
r      13.0
s      14.0
a     900.0
g    1000.0
h    1000.0
dtype: float64

In [53]:
ds1['q']=np.nan

In [54]:
ds1

p     111.0
q       NaN
r      13.0
s      14.0
a     900.0
g    1000.0
h    1000.0
dtype: float64

In [57]:
ds1.dropna(inplace=True)

In [58]:
ds1.isnull()

p    False
r    False
s    False
a    False
g    False
h    False
dtype: bool

In [59]:
ds1['u']=np.nan

In [61]:
ds1['p']=np.nan

In [62]:
ds1

p       NaN
r      13.0
s      14.0
a     900.0
g    1000.0
h    1000.0
u       NaN
dtype: float64

In [63]:
ds1.mean()

585.4

In [64]:
ds1.fillna(ds1.mean(),inplace=True)

In [65]:
ds1

p     585.4
r      13.0
s      14.0
a     900.0
g    1000.0
h    1000.0
u     585.4
dtype: float64

In [70]:
ds1.mode()#most frequent value

0     585.4
1    1000.0
dtype: object

In [67]:
ds1['d']=np.nan

In [68]:
ds1.fillna('unknown',inplace=True)

In [69]:
ds1

p      585.4
r       13.0
s       14.0
a      900.0
g     1000.0
h     1000.0
u      585.4
d    unknown
dtype: object

In [71]:
ds1.describe()

count       8.0
unique      6.0
top       585.4
freq        2.0
dtype: float64

In [72]:
ds2=pd.Series([1,2,3,3,4,5,6,6,7,7,8,3,3,1,2])

In [73]:
ds2.describe()#gives summary

count    15.000000
mean      4.066667
std       2.282438
min       1.000000
25%       2.500000
50%       3.000000
75%       6.000000
max       8.000000
dtype: float64

In [75]:
ds4=pd.Series(['A','B','C','D'])

In [76]:
ds4.describe()

count     4
unique    4
top       A
freq      1
dtype: object

In [77]:
ds2.value_counts()

3    4
1    2
2    2
6    2
7    2
4    1
5    1
8    1
dtype: int64

In [78]:
ds1

p      585.4
r       13.0
s       14.0
a      900.0
g     1000.0
h     1000.0
u      585.4
d    unknown
dtype: object

In [79]:
ds1.sort_index()

a      900.0
d    unknown
g     1000.0
h     1000.0
p      585.4
r       13.0
s       14.0
u      585.4
dtype: object

In [82]:
ds1.sort_index(ascending=False,kind='mergesort')

u      585.4
s       14.0
r       13.0
p      585.4
h     1000.0
g     1000.0
d    unknown
a      900.0
dtype: object

In [84]:
ds1['d']=345

In [85]:
ds1

p     585.4
r      13.0
s      14.0
a     900.0
g    1000.0
h    1000.0
u     585.4
d       345
dtype: object

In [87]:
ds1.sort_values(ascending=False)

g    1000.0
h    1000.0
a     900.0
p     585.4
u     585.4
d       345
s      14.0
r      13.0
dtype: object

In [90]:
#2d array-dataframe
df1=pd.DataFrame({'name':['nagma','vaishnavi','ashish','nazar'],'Maths':np.random.randint(70,79,4)})

In [92]:
df1

        name  Maths
0      nagma     71
1  vaishnavi     76
2     ashish     74
3      nazar     73

In [93]:
#column label
df1.columns

Index(['name', 'Maths'], dtype='object')

In [94]:
df1.dtypes

name     object
Maths     int32
dtype: object

In [95]:
df1.shape

(4, 2)

In [96]:
df1.shape[0]

4

In [97]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   Maths   4 non-null      int32
dtypes: int32(1), object(1)
memory usage: 176.0+ bytes

In [98]:
df1.head()#display first 5 record

        name  Maths
0      nagma     71
1  vaishnavi     76
2     ashish     74
3      nazar     73

In [99]:
df1.head(2)

        name  Maths
0      nagma     71
1  vaishnavi     76

In [100]:
df1.tail()

        name  Maths
0      nagma     71
1  vaishnavi     76
2     ashish     74
3      nazar     73

In [102]:
df1.tail(2)

     name  Maths
2  ashish     74
3   nazar     73

In [104]:
x=df1['name']

In [105]:
type(x)

pandas.core.series.Series

In [106]:
df1['name'][2]#df1[columnname][index value]

'ashish'

In [108]:
df1['Maths'][2]

74

In [110]:
#df1.loc[roundwlabel,columnlabel]
df1.loc[1,'name']

'vaishnavi'

In [112]:
df1.loc[[2,0],['name','Maths']]

     name  Maths
2  ashish     74
0   nagma     71

In [115]:
df1.loc[::-1]

        name  Maths
3      nazar     73
2     ashish     74
1  vaishnavi     76
0      nagma     71

In [ ]:
#df1.iloc[rowindex,columnindex]
#row index-->scalar or list or slice

In [116]:
df1['sci']=[90,78,56,56]

In [117]:
df1

        name  Maths  sci
0      nagma     71   90
1  vaishnavi     76   78
2     ashish     74   56
3      nazar     73   56

In [118]:
df1.describe()

           Maths        sci
count   4.000000   4.000000
mean   73.500000  70.000000
std     2.081666  16.891813
min    71.000000  56.000000
25%    72.500000  56.000000
50%    73.500000  67.000000
75%    74.500000  81.000000
max    76.000000  90.000000

In [119]:
df1.name.describe()

count         4
unique        4
top       nagma
freq          1
Name: name, dtype: object

In [126]:
df1.rename(columns={'sci':'Science'},inplace=True)

In [127]:
df1.rename(index={2:5})

        name  Maths  Science
0      nagma     71       90
1  vaishnavi     76       78
5     ashish     74       56
3      nazar     73       56

In [128]:
df1

        name  Maths  Science
0      nagma     71       90
1  vaishnavi     76       78
2     ashish     74       56
3      nazar     73       56

In [135]:
df1['Total']=df1['Maths']+df1['Science']

In [130]:
df1

        name  Maths  Science  Total
0      nagma     71       90    161
1  vaishnavi     76       78    154
2     ashish     74       56    130
3      nazar     73       56    129

In [136]:
df1.to_csv('Stud.csv')

In [139]:
df1['grade']=df1['Total'].apply(lambda x:'A+' if x>150 else 'A')

In [140]:
df1

        name  Maths  Science  Total grade
0      nagma     71       90    161    A+
1  vaishnavi     76       78    154    A+
2     ashish     74       56    130     A
3      nazar     73       56    129     A

In [141]:
s1=pd.Series(np.array(np.arange(10,20,2)),index=list('abcde'))

In [142]:
s1

a    10
b    12
c    14
d    16
e    18
dtype: int32

In [143]:
dict1={'book':400,'pen':10}
s3=pd.Series(dict1)

In [144]:
s3

book    400
pen      10
dtype: int64

In [145]:
s3['pencil']=10

In [146]:
s3

book      400
pen        10
pencil     10
dtype: int64

In [147]:
s1

a    10
b    12
c    14
d    16
e    18
dtype: int32

In [150]:
s1[-2:-5:-1]

d    16
c    14
b    12
dtype: int32

In [151]:
s3['book':'pencil']

book      400
pen        10
pencil     10
dtype: int64

In [153]:
dict2={'Book':'Mr.X','Pen':'Mr.Y','Pencil':'Mr.A'}
s6=pd.Series(dict2)
s6.min()

'Mr.A'

In [155]:
s6.max()

'Mr.Y'

In [158]:
s6['Scale']=np.nan

In [159]:
s6

Book      Mr.X
Pen       Mr.Y
Pencil    Mr.A
Scale      NaN
dtype: object

In [160]:
s6.count()

3

In [162]:
s6.drop('Scale')

Book      Mr.X
Pen       Mr.Y
Pencil    Mr.A
dtype: object

In [163]:
s6

Book      Mr.X
Pen       Mr.Y
Pencil    Mr.A
Scale      NaN
dtype: object

In [166]:
s6.isnull().sum()

1

In [167]:
s6.fillna('Mr.B')

Book      Mr.X
Pen       Mr.Y
Pencil    Mr.A
Scale     Mr.B
dtype: object

In [168]:
s6

Book      Mr.X
Pen       Mr.Y
Pencil    Mr.A
Scale      NaN
dtype: object

In [169]:
s6['Pen']=np.nan

In [170]:
s6

Book      Mr.X
Pen        NaN
Pencil    Mr.A
Scale      NaN
dtype: object

In [171]:
s6.fillna(40)

Book      Mr.X
Pen         40
Pencil    Mr.A
Scale       40
dtype: object

In [172]:
s6

Book      Mr.X
Pen        NaN
Pencil    Mr.A
Scale      NaN
dtype: object

In [174]:
s6.dropna(inplace=True)

In [175]:
s6

Book      Mr.X
Pencil    Mr.A
dtype: object

In [176]:
s3

book      400.0
pen        10.0
pencil     10.0
Scale       NaN
dtype: float64

In [177]:
s1

a    10
b    12
c    14
d    16
e    18
dtype: int32

In [191]:
s1[1:3]=5

In [192]:
s1

a    10
b     5
c     5
d    50
e    50
dtype: int32

In [193]:
s1.mode()

0     5
1    50
dtype: int32

In [194]:
s1.unique()

array([10,  5, 50])

In [195]:
s1.describe()

count     5.000000
mean     24.000000
std      23.822258
min       5.000000
25%       5.000000
50%      10.000000
75%      50.000000
max      50.000000
dtype: float64

In [198]:
s6.describe()

count        2
unique       2
top       Mr.X
freq         1
dtype: object

In [199]:
s6['duster']='Mr.l'

In [200]:
s6['Chalk']='Mr.l'

In [202]:
s6.describe()

count        4
unique       3
top       Mr.l
freq         2
dtype: object

In [203]:
s6.value_counts()

Mr.l    2
Mr.X    1
Mr.A    1
dtype: int64

In [204]:
s6.sort_index()

Book      Mr.X
Chalk     Mr.l
Pencil    Mr.A
duster    Mr.l
dtype: object

In [205]:
s6.sort_values()

Pencil    Mr.A
Book      Mr.X
duster    Mr.l
Chalk     Mr.l
dtype: object

In [219]:
s5=pd.Series(chr(i) for i in range(65,91,2))
s5

0     A
1     C
2     E
3     G
4     I
5     K
6     M
7     O
8     Q
9     S
10    U
11    W
12    Y
dtype: object

In [228]:
#data frame
df=pd.DataFrame(list(np.arange(ord('A'),ord('M'),2)),columns=['Alpha'],index=[101,102,103,104,105,106])

In [229]:
df

     Alpha
101     65
102     67
103     69
104     71
105     73
106     75

In [240]:
df=pd.DataFrame({'empid':[101,102,103,104],
                 'empname':['nagma','vaishnavi','nazar','sharwari'],
                'salary':[50000,45000,34000,30000]},index=list('abcd'))

In [236]:
df

   empid    empname  salary
a    101      nagma   50000
b    102  vaishnavi   45000
c    103      nazar  340000
d    104   sharwari   30000

In [238]:
df['empid']['a']

101

In [239]:
#loc()
#df.loc[indexlabel,columnlabe]
df.loc['c','empname']

'nazar'

In [241]:
df.loc['b':'d','empname':'salary']

     empname  salary
b  vaishnavi   45000
c      nazar   34000
d   sharwari   30000

In [246]:
#iloc[rowindex,column index]
df.iloc[3,2]
df.iloc[1:5,1:2]

     empname
b  vaishnavi
c      nazar
d   sharwari

In [250]:
#df.loc['b':'d','empid':'empname']
df['Bonous']=[1000,1020,1000,1020]

In [251]:
df

   empid    empname  salary  Bonous
a    101      nagma   50000    1000
b    102  vaishnavi   45000    1020
c    103      nazar   34000    1000
d    104   sharwari   30000    1020

In [249]:
df.drop('Bonous',axis=1)

   empid    empname  salary
a    101      nagma   50000
b    102  vaishnavi   45000
c    103      nazar   34000
d    104   sharwari   30000

In [252]:
df['Total']=df['salary']+df['Bonous']

In [253]:
df

   empid    empname  salary  Bonous  Total
a    101      nagma   50000    1000  51000
b    102  vaishnavi   45000    1020  46020
c    103      nazar   34000    1000  35000
d    104   sharwari   30000    1020  31020

In [257]:
df.loc['a':'d','salary':'Bonous'].sum(axis=1)

a    51000
b    46020
c    35000
d    31020
dtype: int64

In [262]:
df.rename(columns={'salary':'Sal'},inplace=True)

In [263]:
df

   empid    empname    Sal  Bonous  Total
a    101      nagma  50000    1000  51000
b    102  vaishnavi  45000    1020  46020
c    103      nazar  34000    1000  35000
d    104   sharwari  30000    1020  31020

In [264]:
df.columns

Index(['empid', 'empname', 'Sal', 'Bonous', 'Total'], dtype='object')

In [265]:
df.dtypes

empid       int64
empname    object
Sal         int64
Bonous      int64
Total       int64
dtype: object

In [266]:
df.shape

(4, 5)

In [267]:
df.head(2)

   empid    empname    Sal  Bonous  Total
a    101      nagma  50000    1000  51000
b    102  vaishnavi  45000    1020  46020

In [268]:
df.tail(2)

   empid   empname    Sal  Bonous  Total
c    103     nazar  34000    1000  35000
d    104  sharwari  30000    1020  31020

In [269]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   empid    4 non-null      int64
 1   empname  4 non-null      object
 2   Sal      4 non-null      int64
 3   Bonous   4 non-null      int64
 4   Total    4 non-null      int64
dtypes: int64(4), object(1)
memory usage: 364.0+ bytes

In [271]:
df.describe()

            empid           Sal       Bonous         Total
count    4.000000      4.000000     4.000000      4.000000
mean   102.500000  39750.000000  1010.000000  40760.000000
std      1.290994   9322.910847    11.547005   9319.699566
min    101.000000  30000.000000  1000.000000  31020.000000
25%    101.750000  33000.000000  1000.000000  34005.000000
50%    102.500000  39500.000000  1010.000000  40510.000000
75%    103.250000  46250.000000  1020.000000  47265.000000
max    104.000000  50000.000000  1020.000000  51000.000000

In [273]:
df.to_csv('emp.csv')

In [280]:
df

   empid    empname    Sal  Bonous  Total
a    101      nagma  50000    1000  51000
b    102  vaishnavi  45000    1020  46020
c    103      nazar  34000    1000  35000
d    104   sharwari  30000    1020  31020

In [287]:
s1=df['Sal'].apply(lambda val : True if val>=35000 else False)

In [288]:
s1

a     True
b     True
c    False
d    False
Name: Sal, dtype: bool

In [295]:
df.where(s1).dropna()

   empid    empname      Sal  Bonous    Total   val
a  101.0      nagma  50000.0  1000.0  51000.0  True
b  102.0  vaishnavi  45000.0  1020.0  46020.0  True

In [296]:
df

   empid    empname    Sal  Bonous  Total    val
a    101      nagma  50000    1000  51000   True
b    102  vaishnavi  45000    1020  46020   True
c    103      nazar  34000    1000  35000  False
d    104   sharwari  30000    1020  31020  False

In [297]:
df['dept']=['Sales','Accounts','It','It']

In [298]:
df

   empid    empname    Sal  Bonous  Total    val      dept
a    101      nagma  50000    1000  51000   True     Sales
b    102  vaishnavi  45000    1020  46020   True  Accounts
c    103      nazar  34000    1000  35000  False        It
d    104   sharwari  30000    1020  31020  False        It

In [301]:
df['desg']=df['Sal'].apply(lambda x:'Manager' if x>45000
                          else 'Ast Manager' if x==45000
                           else 'Officer')

In [302]:
df

   empid    empname    Sal  Bonous  Total    val      dept         desg
a    101      nagma  50000    1000  51000   True     Sales      Manager
b    102  vaishnavi  45000    1020  46020   True  Accounts  Ast Manager
c    103      nazar  34000    1000  35000  False        It      Officer
d    104   sharwari  30000    1020  31020  False        It      Officer

In [304]:
df.drop('val',axis=1,inplace=True)

In [305]:
df

   empid    empname    Sal  Bonous  Total      dept         desg
a    101      nagma  50000    1000  51000     Sales      Manager
b    102  vaishnavi  45000    1020  46020  Accounts  Ast Manager
c    103      nazar  34000    1000  35000        It      Officer
d    104   sharwari  30000    1020  31020        It      Officer

In [4]:
idf=pd.read_csv('d:\\item_details.csv')

In [5]:
idf

   itemid itemname   itemcost supplier grade
0       8     chalk     65.76        X     A
1      12    Pencil      4.00        Y     B
2      13       Pen     43.00        X     A
3      15    Duster     54.00        Y     C

In [ ]:
Read the itemDetails from ExcelFie
1.Add column quantity with diff values
2.Add Col Bill with qty*cost
3.Remove obj where ever supplier is nan
4.show all itemdetails with grade A
5.create eligibility column with values 'can Export' and 'canot export' based on grade and cost
 if grade is 'A' and cost is above 60 then only item is eligible for exporting
6.Show supliers numbers of items availabe
7.Sort this data by items cost in descending order, if cost is same then according to item in ascending

In [308]:
g=df.groupby(by='dept')

In [319]:
for iname,records in g:
    print(iname,'____')
    print(records.sum(axis=0))

Accounts ____
empid              102
empname      vaishnavi
Sal              45000
Bonous            1020
Total            46020
dept          Accounts
desg       Ast Manager
dtype: object
It ____
empid                 207
empname     nazarsharwari
Sal                 64000
Bonous               2020
Total               66020
dept                 ItIt
desg       OfficerOfficer
dtype: object
Sales ____
empid          101
empname      nagma
Sal          50000
Bonous        1000
Total        51000
dept         Sales
desg       Manager
dtype: object

In [321]:
df.groupby(by='dept')['Sal'].sum()

dept
Accounts    45000
It          64000
Sales       50000
Name: Sal, dtype: int64